Ninagawa123/Meridian_TWIN/Meridian_TWIN_for_ESP32/src/main.cpp
// Meridian_TWIN_for_ESP32_20231231 By Izumi Ninagawa & Meridian Project
// MIT Licenced.
//
// Meridan TWIN ESP32用スケッチ 20231231版
// スレッド制を見直し, 連続する工程をひとまとまりに.
// UDPの受信待受とSPI待受でループするようにした.
// UDP受信についてタイムアウトを導入.
// 動作が大幅に安定し通信エラーはほぼゼロ。
// PCからのリモコン受信をTeensyにも反映できるように調整 ここまで2022年までの改訂.
// 2023.05.03 変数を調整し,関数とライブラリを使うように変更
// 2023.05.03 各種設定はconfig.hからまとめて行えるようにした.
// 2023.05.03 シーケンス番号を0-60000に設定, udp受信値についてチェック.
// 2023.05.03 固定IPアドレスが設定可能.
// 2023.06.17 起動メッセージをwifi検出前から出るように変更.
// 2023.06.17 フローモニタ（MONITOR_FLOWでオンオフ）, 起動メッセージをライブラリ関数化.
// 2023.06.30 ライブラリ、変数の整合
// 2023.07.01 処理順についての日本語コメントの整理
// 2023.07.01 関数コメントの整理
// 2023.07.01 リモコン関連の調整
// 2023.12.31 key.hの分離
// 2023.12.31 stepモードに対応

// 【課題】2022.07.30
// PS4リモコンを接続するとTeensyの受信スキップが5~10%発生する.
// Wiiリモコンを接続すると受信スキップは1%以下だが、最初のコネクション確立がしにくい.
// よって現状では通信に影響のないKRC-5FHをTeensy側に接続するのがよい.
// I2C経由の無線でさまざまなコントローラーに接続できるものを開発中。

#define VERSION "Meridian_TWIN_for_ESP32_20231231." // バージョン表示

//================================================================================================================
//---- 初 期 設 定  -----------------------------------------------------------------------------------------------
//================================================================================================================

/* コンフィグファイルの読み込み */
#include "config.h"
#include "keys.h"

/* ヘッダファイルの読み込み */
#include "main.h"

/* ライブラリ導入 */
#include <Meridian.h>
MERIDIANFLOW::Meridian mrd; // ライブラリのクラスを mrdという名前でインスタンス化
#include <Arduino.h>
#include <IPAddress.h>
#include <WiFi.h>             // UDPの設定
#include <WiFiUdp.h>          // UDPの設定
WiFiUDP udp;                  // wifi設定
#include <ESP32DMASPISlave.h> // DMAでSPI通信を高速化するめのライブラリ
ESP32DMASPI::Slave slave;
#include <PS4Controller.h> // PS4コントローラー
#include <ESP32Wiimote.h>  // Wiiコントローラー
ESP32Wiimote wiimote;
#include <SPI.h> // SPI自体は使用しないがBNO055に必要

/* PS4リモコンのためのペアリング情報設定用ライブラリ */
#include "esp_bt_main.h"
#include "esp_bt_device.h"
#include "esp_gap_bt_api.h"
#include "esp_err.h"
uint8_t pairedDeviceBtAddr[BT_PAIR_MAX_DEVICES][6];
char bda_str[18];

/* Meridim配列設定 */
const int MSG_BUFF = MSG_SIZE * 2;     // Meridim配列のバイト長
const int MSG_ERR = MSG_SIZE - 2;      // エラーフラグの格納場所（配列の末尾から2つめ）
const int MSG_ERR_u = MSG_ERR * 2 + 1; // エラーフラグの格納場所（上位8ビット）
const int MSG_ERR_l = MSG_ERR * 2;     // エラーフラグの格納場所（下位8ビット）

/* システム用変数 */
uint8_t *s_spi_meridim_dma; // DMA用
uint8_t *r_spi_meridim_dma; // DMA用
TaskHandle_t thp[4];        // マルチスレッドのタスクハンドル格納用

/* フラグ関連変数 */
bool flag_spi_ready = true; // SPI送信の順番制御用
bool flag_udp_rsvd = true;  // UDPスレッドでの受信完了フラグ
bool flag_udp_busy = false; // UDPスレッドでの受信中フラグ（送信抑制）
bool flag_udp_board_passive = false; // UDP受信のパッシブモード（0:デフォルト, 1:パッシブ/PC側が通信周期制御）
int mrd_seq_r_expect = 0;   // フレーム毎に前回受信値に+１として受信値と比較（-30000~29999)

/* Meridim配列用の共用体の設定 */
typedef union
{
  short sval[MSG_SIZE + 4];
  unsigned short usval[MSG_SIZE + 2]; // 上記のunsigned short型
  uint8_t bval[MSG_BUFF + 4];
} UnionData;
UnionData s_spi_meridim; // SPI受信用共用体
UnionData r_spi_meridim; // SPI受信用共用体
UnionData s_udp_meridim; // UDP送信用共用体
UnionData r_udp_meridim; // UDP受信用共用体
// UnionData pad_bt_meridim; // リモコンのBT受信用共用体のインスタンスを宣言

/* リモコン用変数 */
// int joypad_search = 3;
typedef union
{
  short sval[4];       // short型で4個の配列データを持つ
  uint16_t usval[4];   // 上記のunsigned short型
  int8_t bval[8];      // 上記のbyte型
  uint8_t ubval[8];    // 上記のunsigned byte型
  uint64_t ui64val[1]; // 上記のunsigned int16型
                       // button, pad_stick_L_x:pad_stick_L_y,
                       // pad_stick_R_x:pad_stick_R_y, pad_L2_val:pad_R2_val
} UnionPad;
UnionPad pad_array = {0}; // リモコン値格納用の配列

unsigned short pad_btn = 0;
int pad_stick_R = 0;
int pad_stick_R_x = 0;
int pad_stick_R_y = 0;
int pad_stick_L = 0;
int pad_stick_L_x = 0;
int pad_stick_L_y = 0;
int pad_stick_V = 0;
int pad_R2_val = 0;
int pad_L2_val = 0;

//================================================================================================================
//---- セ ッ ト ア ッ プ -------------------------------------------------------------------------------------------
//================================================================================================================
void setup()
{
  //-------------------------------------------------------------------------
  //---- 起 動 時 設 定  -----------------------------------------------------
  //-------------------------------------------------------------------------

  /* シリアルモニタ表示 */
  Serial.begin(SERIAL_PC_BPS);
  delay(120); // シリアルの開始を待ち安定化させるためのディレイ（ほどよい）
 
  /* 起動メッセージ1 */
  mrd.print_esp_hello_start(VERSION, String(SERIAL_PC_BPS), WIFI_AP_SSID);
  //mrd.print_esp_hello_start(String(VERSION), String(SERIAL_PC_BPS), String(WIFI_AP_SSID));


  /* WiFiの初期化と開始 */
  WiFi.disconnect(true, true); // WiFi接続をリセット
  if (MODE_FIXED_IP)           // 固定IP設定の場合には以下を実行
  {
    if (!WiFi.config(makeIPAddress(FIXED_IP_ADDR), makeIPAddress(FIXED_IP_GATEWAY), makeIPAddress(FIXED_IP_SUBNET)))
    {
      Serial.println("Wifi Fixed IP failed to configure!");
    }
  }
  WiFi.begin(WIFI_AP_SSID, WIFI_AP_PASS); // WiFiに接続
  while (WiFi.status() != WL_CONNECTED)
  {           // https://www.arduino.cc/en/Reference/WiFiStatus 返り値一覧
    delay(1); // 接続が完了するまでループで待つ
  }

  /* 起動メッセージ2 */
  mrd.print_esp_hello_ip(WIFI_SEND_IP, WiFi.localIP().toString(), FIXED_IP_ADDR, MODE_FIXED_IP);

  /* UDP通信の開始 */
  udp.begin(UDP_RESV_PORT);
  delay(100);

  /* Bluetoothリモコン関連の処理 */
  bt_settings();

  /* SPI送受信用DMAの設定 */
  s_spi_meridim_dma = slave.allocDMABuffer(MSG_BUFF + 4); // DMAバッファ設定
  r_spi_meridim_dma = slave.allocDMABuffer(MSG_BUFF + 4); // DMAバッファ設定
  // DMAは高速な上, 一度に送受信できるデータ量を増やせる
  // バッファサイズは4で割り切れる必要があり, また末尾に4バイト分0が入る不具合があるので+4で対策

  /* SPI送受信バッファをリセット */
  memset(s_spi_meridim_dma, 0, MSG_BUFF + 4); // ※+4は不具合対策
  memset(r_spi_meridim_dma, 0, MSG_BUFF + 4); // ※+4は不具合対策

  /* SPI通信の初回送信データをセット */
  memset(s_spi_meridim.bval, 0, MSG_BUFF + 4);                                   // ※+4は不具合対策
  s_spi_meridim.sval[MSG_SIZE - 1] = mrd.cksm_val(s_spi_meridim.sval, MSG_SIZE); // データ末尾にチェックサムを入れる
  memcpy(s_spi_meridim_dma, s_spi_meridim.bval, MSG_BUFF + 4);                   // 送信データをDMAバッファに転記

  /* SPI通信の設定 */
  slave.setDataMode(SPI_MODE3);
  slave.setMaxTransferSize(MSG_BUFF + 4);
  slave.setDMAChannel(2); // 専用メモリの割り当て(1か2のみ)
  slave.setQueueSize(1);  // キューサイズ とりあえず1
  slave.begin();          // 引数を指定しなければデフォルトのSPI（SPI2,HSPIを利用）ピン番号は CS: 15, CLK: 14, MOSI: 13, MISO: 12
  delay(100);             // この行は削除できそう

  /* スレッドの開始 */
  // マルチスレッドの宣言（無線系はすべてCORE0で動く.メインループはCORE1）
  //  xTaskCreatePinnedToCore(Core1_SPI, "Core1_SPI", 4096, NULL, 15, &thp[0], 1);
  //  xTaskCreatePinnedToCore(Core0_UDP, "Core0_UDP", 4096, NULL, 10, &thp[1], 0);
  xTaskCreatePinnedToCore(Core0_BT_r, "Core0_BT_r", 4096, NULL, 5, &thp[2], 0);

  Serial.println("-) Meridian TWIN system on side ESP32 now flows. (-"); //
}

//================================================================================================================
//---- M A I N  L O O P -----------------------------------------------------------------------------------------
//================================================================================================================
void loop()
{
  //////// [ 1 ]  S P I 送 受 信 の 実 行  /////////////////////////////////////////////
  /* @[1-1] SPI通信のトランザクションがなければデータをキューに補充 */
  if (slave.remained() == 0)
  {
    if (flag_spi_ready) // SPI送信データの作成が完了しているか
    {
      mrd.monitor_check_flow("[1]", MONITOR_FLOW); // 動作チェック用シリアル表示
      slave.queue(r_spi_meridim_dma, s_spi_meridim_dma, MSG_BUFF + 4);
      flag_spi_ready = false;
    }
  }

  // [check!] ここがTeensyをマスターとして実施されるSPI通信の完了を待つ待機ループになる

  /* @[1-2] SPI通信で受信したデータについての処理（工程[6] まで一気に行う） */
  while (slave.available()) // SPI受信を完了したデータについての作業はこのwhileの中で行う
  {
    memcpy(s_udp_meridim.bval, r_spi_meridim_dma, MSG_BUFF + 4); // DMAのSPI受信データをUDP送信配列に転記
    slave.pop();                                                 // DMAのデータ配列の先頭を削除

    //////// [ 2 ]  U D P 送 信 デ ー タ 作 成  /////////////////////////////////////////////
    mrd.monitor_check_flow("[2]", MONITOR_FLOW); // 動作チェック用シリアル表示

    /* @[2-1] このESP32内で計算処理したデータをMeridimに格納する */
    // ・Teensy→ESP32→PCという経路.
    // ・Teensyからのリモコン値はここでのみ補足可能.
    // ・ここでチェックサムを行ってもよい.
    // ・今回は特になにもなし.

    //////// [ 3 ]  U D P 送 信 実 行  ///////////////////////////////////////////////////
    mrd.monitor_check_flow("[3]", MONITOR_FLOW); // 動作チェック用シリアル表示

    /* @[3-1] UDP送受信の実行 */
    flag_udp_busy = true; // UDP使用中のフラグをアゲる
    udp_send();           // UDP送受信の実行

    //////// [ 4 ]  U D P 受 信 待 受 ル ー プ  //////////////////////////////////////////
    mrd.monitor_check_flow("[4]", MONITOR_FLOW); // 動作チェック用シリアル表示

