Ninagawa123/Meridian_TWIN/Meridian_TWIN_for_ESP32/src/main.cpp
    /* @[4-1] UDP受信の待受 */
    flag_udp_rsvd = false;
    int udp_time_count = 0;
    while (!flag_udp_rsvd) // データの受信バッファ確認
    {
      short udp_packet = udp.parsePacket();
      if (udp_packet >= MSG_BUFF)
      {
        udp.read(r_udp_meridim.bval, MSG_BUFF); // データの受信
        flag_udp_rsvd = true;
        mrd.monitor_check_flow("UdpRsvd", MONITOR_FLOW); // 動作チェック用シリアル表示
      }
      if (flag_udp_board_passive){// パッシブモードならUDP待ちでタイムアウトしない
        mrd.monitor_check_flow("*Passive mode.", MONITOR_FLOW); // 動作チェック用シリアル表示
      }
      else if(udp_time_count > UDP_TIMEOUT) // UDPの受信待ちのタイムアウト
      {
        mrd.monitor_check_flow("*UdpResvTimeOut", MONITOR_FLOW); // 動作チェック用シリアル表示
        break;
      }
      udp_time_count++;
      delay(1);
    }
    flag_udp_busy = false; // UDP使用中のフラグをサゲる

    //////// [ 5 ]  U D P 受 信 品 質 チ ェ ッ ク  ////////////////////////////////////////
    mrd.monitor_check_flow("[5]", MONITOR_FLOW); // 動作チェック用シリアル表示

    /* @[5-1] UDP受信データ r_udp_meridim のチェックサムを確認. */
    if (mrd.cksm_rslt(r_udp_meridim.sval, MSG_SIZE))
    {
      /* @[5-1a] 受信成功ならUDP受信データをSPI送信データに上書き更新する.*/
      memcpy(s_spi_meridim.bval, r_udp_meridim.bval, MSG_BUFF + 4);
      s_spi_meridim.bval[MSG_ERR_u] &= 0b10111111; // meridimの[MSG_ERR]番の14ビット目(ESPのUDP受信成否)のフラグをサゲる.
    }
    else
    {
      /* @[5-1b] 受信失敗なら今回の受信データを使わず、前回のSPI送信データにエラーフラグだけ上乗せする.*/
      s_spi_meridim.bval[MSG_ERR_u] |= 0b01000000; // meridimの[MSG_ERR]番の14ビット目(ESPのUDP受信成否)のフラグをアゲる.
    }

    /* @[5-2] 連番スキップ検出 */
    /* @[5-2-1] シーケンス番号の予想値の生成 */
    mrd_seq_r_expect = mrd.seq_predict_num(mrd_seq_r_expect);
    if (MONITOR_SEQ)
    {
      Serial.print("SeqNum exp: ");
      Serial.print(mrd_seq_r_expect);
      Serial.print(" / udp_rsvd: ");
      Serial.print(int(r_udp_meridim.usval[1]));
    }

    /* @[5-2-2] シーケンス番号予想値と受信値が合致しているかのチェック */
    if (mrd.seq_compare_nums(mrd_seq_r_expect, int(r_udp_meridim.usval[1]))) // 受信シーケンス番号の値が予想通りなら,
    {
      s_spi_meridim.bval[MSG_ERR_u] &= 0b11111011; // エラーフラグ10番(ESP受信のスキップ検出)をサゲる.
      if (MONITOR_SEQ)
      {
        Serial.println("  ok.");
      }
    }
    else // 受信シーケンシャルカウンタの値が予想と違ったら,
    {
      mrd_seq_r_expect = int(r_udp_meridim.usval[1]); // 現在の受信値を予想結果としてキープ
      s_spi_meridim.bval[MSG_ERR_u] |= 0b00000100;    // エラーフラグ10番(ESP受信のスキップ検出)をアゲる.
      if (MONITOR_SEQ)
      {
        Serial.println(" *NG*");
      }
    }

    // [check!] ここで s_spi_meridim にはチェック済みの r_udp_meridim が転記され, ESP32UDP受信エラーフラグも入った状態.

    //////// [ 6 ]  受 信 値 に よ る 処 理  ///////////////////////////////////////////
    /* @[6-1] マスターコマンドによる処理 */
    if (s_spi_meridim.sval[0] == MCMD_BOARD_TRANSMIT_PASSIVE) // ボードが受信を待ち返信するモード（PC側が定刻送信）
    {
      flag_udp_board_passive = 1;
      }

    if (s_spi_meridim.sval[0] == MCMD_BOARD_TRANSMIT_ACTIVE) // ボードが受信を待ち返信するモード（PC側が定刻送信）
      {
        flag_udp_board_passive = 0;
      }

    //////// [ 7 ]  S P I 送 信 デ ー タ 作 成  ///////////////////////////////////////////
    mrd.monitor_check_flow("[6]\n", MONITOR_FLOW); // 動作チェック用シリアル表示

    /* @[7-1] ユーザー定義の送信データの書き込み */
    // ・Teensyへ送るデータをこのパートで作成, 書き込み.
    // ・今回はとくに何もしない.

    /* @[7-2] リモコンデータの書き込み */
    for (int i = 0; i < 4; i++)
    { // Meridim配列のリモコン該当箇所に、ESPで受信したリモコン値を加算する
      s_spi_meridim.sval[i + 15] = r_udp_meridim.sval[i + 15] | pad_array.usval[i];
    }

    /* @[7-3] フレームスキップ検出用のカウントを転記して格納（PCからのカウントと同じ値をESPに転送）*/
    // → すでにPCから受け取った値がs_spi_meridim.sval[1]に入っているのでここでは何もしない.

    /* @[7-4] チェックサムの追記 */
    s_spi_meridim.sval[MSG_SIZE - 1] = mrd.cksm_val(s_spi_meridim.sval, MSG_SIZE);
    // [check!] ここでSPI送信データ"s_spi_meridim"はチェックサムが入り完成している状態.

    /* @[7-5] 完成したSPI送信データをDMAに転記*/
    memcpy(s_spi_meridim_dma, s_spi_meridim.bval, MSG_BUFF + 4);
    flag_spi_ready = true; // SPI送信の順番制御用
                           // [check!] この時点で 次回のSPI送受信に備え、DMAにデータが格納された状態.
  }
}

//================================================================================================================
//---- 関 数 各 種  -----------------------------------------------------------------------------------------------
//================================================================================================================

/**
 * @brief Convert a period-separated IP address string to an IPAddress object.
 *
 * @param ip_str const char*, period-separated IP address string.
 * @return IPAddress
 */
IPAddress makeIPAddress(const char *ip_str)
{
  int _a, _b, _c, _d;
  sscanf(ip_str, "%d.%d.%d.%d", &_a, &_b, &_c, &_d);
  return IPAddress(_a, _b, _c, _d);
}

/**
 * @brief Pairing Bluetooth.
 *
 */
bool initBluetooth()
{
  if (!btStart())
  {
    Serial.println("Failed to initialize controller");
    return false;
  }

  if (esp_bluedroid_init() != ESP_OK)
  {
    Serial.println("Failed to initialize bluedroid");
    return false;
  }

  if (esp_bluedroid_enable() != ESP_OK)
  {
    Serial.println("Failed to enable bluedroid");
    return false;
  }
  return true;
}

/**
 * @brief Get a Bluetooth pairing address.
 *
 * @param bda A pointer that points to the Bluetooth Device Address (BDA).
 *            The BDA is represented as a 6-byte array of bytes.
 * @param str A pointer to store the converted result string.
 * @param size The size of the str buffer.
 * @return char*
 */
char *bda2str(const uint8_t *bda, char *str, size_t size)
{
  if (bda == NULL || str == NULL || size < 18)
  {
    return NULL;
  }
  sprintf(str, "%02x:%02x:%02x:%02x:%02x:%02x",
          bda[0], bda[1], bda[2], bda[3], bda[4], bda[5]);
  return str;
}

/**
 * @brief Receive input values from the PS4 remote control
 *        and store them in the following variables:
 *        pad_btn, pad_L2_val, pad_R2_val, pad_stick_L, pad_stick_R, pad_stick_V
 */
void pad_ps4_receive()
{
  // Below has all accessible outputs from the controller
  if (PS4.isConnected())
  {
    static bool isFirstCall = true; // 初回の呼び出しフラグ
    if (isFirstCall)
    {
      Serial.println("PS4 controller successfully connected. ");
      isFirstCall = false; // 初回の呼び出しフラグをオフにする
    }
    pad_btn = 0;
    if (JOYPAD_GENERALIZE)
    { // 一般化,ROS準拠
      if (PS4.Up())
        pad_btn |= (0b00000000 * 256) + 0b00010000; // 16
      if (PS4.Right())
        pad_btn |= (0b00000000 * 256) + 0b00100000; // 32
      if (PS4.Down())
        pad_btn |= (0b00000000 * 256) + 0b01000000; // 64
      if (PS4.Left())
        pad_btn |= (0b00000000 * 256) + 0b10000000; // 128
      if (PS4.Triangle())
        pad_btn |= (0b00010000 * 256) + 0b00000000; // 4096
      if (PS4.Circle())
        pad_btn |= (0b00100000 * 256) + 0b00000000; // 8192
      if (PS4.Cross())
        pad_btn |= (0b01000000 * 256) + 0b00000000; // 16384
      if (PS4.Square())
        pad_btn |= (0b10000000 * 256) + 0b00000000; // 32768
      if (PS4.UpRight())
        pad_btn |= (0b00000000 * 256) + 0b00110000; // 48
      if (PS4.DownRight())
        pad_btn |= (0b00000000 * 256) + 0b01100000; // 96
      if (PS4.UpLeft())
        pad_btn |= (0b00000000 * 256) + 0b10010000; // 144
      if (PS4.DownLeft())
        pad_btn |= (0b00000000 * 256) + 0b11000000; // 192
      if (PS4.Share())
        pad_btn |= (0b00000000 * 256) + 0b00000001; // 1
      if (PS4.L3())
        pad_btn |= (0b00000000 * 256) + 0b00000010; // 2
      if (PS4.R3())
        pad_btn |= (0b00000000 * 256) + 0b00000100; // 4
      if (PS4.Options())
        pad_btn |= (0b00000000 * 256) + 0b00001000; // none
      if (PS4.L1())
        pad_btn |= (0b00000100 * 256) + 0b00000000; // 1024
      if (PS4.R1())
        pad_btn |= (0b00001000 * 256) + 0b00000000; // 2048

      if (PS4.L2())
      {
        pad_btn |= (0b00000001 * 256) + 0b00000000;
        pad_L2_val = constrain(PS4.L2Value(), 0, 255); // 256
      }
      if (PS4.R2())
      {
        pad_btn |= 512;                                //(0x00000010 * 256) + 0b00000000;
        pad_R2_val = constrain(PS4.R2Value(), 0, 255); // 512
      }

      if (PS4.PSButton())
        pad_btn |= (0b00000000 * 256) + 0b01010000; // same as up & down
      if (PS4.Touchpad())
        pad_btn |= (0b00000000 * 256) + 0b10100000; // same as left & right

      if (PS4.LStickX())
      {
        pad_stick_L_x = constrain(PS4.LStickX(), -127, 127);
      }
      if (PS4.LStickY())
      {
        pad_stick_L_y = constrain(PS4.LStickY(), -127, 127);
      }
      if (PS4.RStickX())
      {
        pad_stick_R_x = constrain(PS4.RStickX(), -127, 127);
      }
      if (PS4.RStickY())
      {
        pad_stick_R_y = constrain(PS4.RStickY(), -127, 127);
      }
    }
    else
    { // ストレート

      if (PS4.Up())
        pad_btn |= (0b00000000 * 256) + 0b00010000; // 16
      if (PS4.Right())
        pad_btn |= (0b00000000 * 256) + 0b00100000; // 32
      if (PS4.Down())
        pad_btn |= (0b00000000 * 256) + 0b01000000; // 64
      if (PS4.Left())
        pad_btn |= (0b00000000 * 256) + 0b10000000; // 128
      if (PS4.Triangle())
        pad_btn |= (0b00010000 * 256) + 0b00000000; // 4096
      if (PS4.Circle())
        pad_btn |= (0b00100000 * 256) + 0b00000000; // 8192
      if (PS4.Cross())
        pad_btn |= (0b01000000 * 256) + 0b00000000; // 16384
      if (PS4.Square())
        pad_btn |= (0b10000000 * 256) + 0b00000000; // 32768
      if (PS4.UpRight())
        pad_btn |= (0b00000000 * 256) + 0b00110000; // 48
      if (PS4.DownRight())
        pad_btn |= (0b00000000 * 256) + 0b01100000; // 96
      if (PS4.UpLeft())
        pad_btn |= (0b00000000 * 256) + 0b10010000; // 144
      if (PS4.DownLeft())
        pad_btn |= (0b00000000 * 256) + 0b11000000; // 192
      if (PS4.L1())
        pad_btn |= (0b00000100 * 256) + 0b00000000; // 1024
      if (PS4.R1())
        pad_btn |= (0b00001000 * 256) + 0b00000000; // 2048
      if (PS4.Share())
        pad_btn |= (0b00000000 * 256) + 0b00000001; // 1
      if (PS4.R3())
        pad_btn |= (0b00000000 * 256) + 0b00000010; // 2
      if (PS4.L3())
        pad_btn |= (0b00000000 * 256) + 0b00000100; // 4
      if (PS4.Options())
        pad_btn |= (0b00000000 * 256) + 0b00001000; // 8
      // if (PS4.PSButton())
      //   pad_btn |= (0b00000000 * 256) + 0b01010000; // same as up & down
      // if (PS4.Touchpad())
      //   pad_btn |= (0b00000000 * 256) + 0b10100000; // same as left & right
      if (PS4.L2())
      {
        pad_btn |= (0b00000001 * 256) + 0b00000000;
        pad_L2_val = constrain(PS4.L2Value(), 0, 255);
      }
      if (PS4.R2())
      {
        pad_btn |= 512; //(0x00000010 * 256) + 0b00000000;
        pad_R2_val = constrain(PS4.R2Value(), 0, 255);
      }
      if (PS4.LStickX())
      {
        pad_stick_L_x = constrain(PS4.LStickX(), -127, 127);
      }
      if (PS4.LStickY())
      {
        pad_stick_L_y = constrain(PS4.LStickY(), -127, 127);
      }
      if (PS4.RStickX())
      {
        pad_stick_R_x = constrain(PS4.RStickX(), -127, 127);
      }
      if (PS4.RStickY())
      {
        pad_stick_R_y = constrain(PS4.RStickY(), -127, 127);
      };
    }
    pad_array.usval[0] = pad_btn;                            // short型で4個の配列データを持つ
    pad_array.sval[1] = pad_stick_L_x * 256 + pad_stick_L_y; // short型で4個の配列データを持つ
    pad_array.sval[2] = pad_stick_R_x * 256 + pad_stick_R_y; // short型で4個の配列データを持つ
    pad_array.sval[3] = pad_L2_val * 256 + pad_R2_val;       // short型で4個の配列データを持つ
  }
}

/**
 * @brief Receive input values from the wiimote
 *        and store them in pad_btn.
 */
void pad_wiimote_receive()
{
  wiimote.task();
  if (wiimote.available() > 0)
  {
    static bool isFirstCall = true; // 初回の呼び出しフラグ
    if (isFirstCall)
    {
      Serial.println("Wiimote successfully connected. ");
      isFirstCall = false; // 初回の呼び出しフラグをオフにする
    }
    uint16_t button = wiimote.getButtonState();
    pad_btn = 0;
    for (int i = 0; i < 16; i++)
    {
      uint16_t mask = 1 << i;
      if ((JOYPAD_GENERALIZE && (PAD_WIIMOTE_SOLO[i] & button)) || (!JOYPAD_GENERALIZE && (PAD_WIIMOTE_ORIG[i] & button)))
      {
        pad_btn |= mask;
      }
    }
    pad_array.usval[0] = pad_btn; // short型で4個の配列データを持つ
  }
  if (MOUNT_JOYPAD == 6)
  {
    // NunchukState nunchuk = wiimote.getNunchukState();
    //  int calib_l1x = 5;  // キャリブレーション値
    //   int calib_l1y = -6; // キャリブレーション値
    //    pad_stick_L = ((nunchuk.xStick + calib_l1x - 127) * 256 + (nunchuk.yStick - 127 + calib_l1y));
    //     if (nunchuk.cBtn == 1)
    //       pad_btn |= (0b00000100 * 256) + 0b00000000;
    //      if (nunchuk.zBtn == 1)
    //        pad_btn |= (0x00000001 * 256) + 0b00000000;
    //       pad_array.sval[1] = pad_stick_L_x * 256 + pad_stick_L_y;
    //       pad_array.sval[2] = pad_stick_R_x * 256 + pad_stick_R_y;
    //       pad_array.sval[3] = pad_L2_val * 256 + pad_R2_val;
  }
}

/**
 * @brief Send s_udp_meridim to UDP.
 *
 */
void udp_send()
{
  udp.beginPacket(WIFI_SEND_IP, UDP_SEND_PORT); // Start UDP packet.
  udp.write(s_udp_meridim.bval, MSG_BUFF);
  udp.endPacket(); // End UDP packet.
}

/**
 * @brief Check Check received UDP packets.
 *        When a reception is complete, store the values in the union r_udp_meridim
 *        and set the flag_udp_rsvd flag to true.
 */
void udp_receive()
{
  if (udp.parsePacket() >= MSG_BUFF) // Check the receive buffer for data.
  {
    udp.read(r_udp_meridim.bval, MSG_BUFF); // Receive data.
  }
}

/**
 * @brief Setting for PS4 Bluetooth.
 *
 */
void bt_settings()
{
  /* Bluetoothの初期化 */
  if (true) // ※常にBluetoothの初期化とアドレス表示を実行する設定
  {

    initBluetooth();
    Serial.print("ESP32's Bluetooth Mac Address is => "); // ESP32自身のBluetoothMacアドレスを表示
    Serial.println(bda2str(esp_bt_dev_get_address(), bda_str, 18));
    delay(100);

