Ninagawa123/Meridian_TWIN/Meridian_TWIN_for_ESP32/src/main.cpp
    /* Bluetoothのペアリング情報 */
    int bt_count = esp_bt_gap_get_bond_device_num();
    if (!bt_count)
    {
      Serial.println("No bonded BT device found.");
    }
    else
    {
      Serial.print("Bonded BT device count: ");
      Serial.println(bt_count);
      if (BT_PAIR_MAX_DEVICES < bt_count)
      {
        bt_count = BT_PAIR_MAX_DEVICES;
        Serial.print("Reset bonded device count: ");
        Serial.println(bt_count);
      }
      esp_err_t tError = esp_bt_gap_get_bond_device_list(&bt_count, pairedDeviceBtAddr);
      if (ESP_OK == tError)
      {
        for (int i = 0; i < bt_count; i++)
        {
          Serial.print("Found bonded BT device # ");
          Serial.print(i);
          Serial.print(" -> ");
          Serial.println(bda2str(pairedDeviceBtAddr[i], bda_str, 18));
          if (BT_REMOVE_BONDED_DEVICES)
          {
            esp_err_t tError = esp_bt_gap_remove_bond_device(pairedDeviceBtAddr[i]);
            if (ESP_OK == tError)
            {
              Serial.print("Removed bonded BT device # ");
            }
            else
            {
              Serial.print("Failed to remove bonded BT device # ");
            }
            Serial.println(i);
          }
        }
      }
    }
  }

  /* PS4コントローラの接続開始 */
  if (MOUNT_JOYPAD == 4)
  {
    PS4.begin(BT_MAC_ADDR); // ESP32のMACが入ります.PS4にも設定します.
    Serial.println("Try to connect PS4 controller...");
  }

  /* Wiiコントローラの接続開始 */
  if ((MOUNT_JOYPAD == 5) or (MOUNT_JOYPAD == 6))
  {
    Serial.println("Try to connect Wiimote...");
    wiimote.init();
  }
}

//================================================================================================================
//---- Bluetooth 用 ス レ ッ ド -----------------------------------------------------------------------------------
//================================================================================================================
void Core0_BT_r(void *args)
{ // サブCPU(Core0)で実行するプログラム
  int _wait = JOYPAD_POLLING - 1;
  if (_wait < 0)
  {
    _wait = 0;
  }

  while (true)
  {                        // Bluetooth待受用の無限ループ
    while (!flag_udp_busy) // UDP使用中を避ける
    {
      // PS4 controller
      if (MOUNT_JOYPAD == 4)
      {
        pad_ps4_receive();
      }
      // Wiimote
      if ((MOUNT_JOYPAD == 5) or (MOUNT_JOYPAD == 6))
      {
        pad_wiimote_receive();
      }
      delay(_wait); // _wait ms
    }
    delay(1); // 1ms
  }
}
